tap "grishka/grishka"
tap "homebrew/services"
# Securely transfers data between computers
brew "magic-wormhole"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Distributed revision control system
brew "git"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Interactive environments for writing and running code
brew "jupyterlab", restart_service: :changed
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Audio utility
cask "background-music"
# VPN client for secure internet access and private browsing
cask "expressvpn"
# Sandbox construction video game
cask "minecraft"
# Unofficial Google Nearby Share app
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
cask "neardrop"
vscode "bierner.markdown-preview-github-styles"
vscode "c1495616js.paste-url-md"
vscode "davidanson.vscode-markdownlint"
vscode "dedsec727.jekyll-run"
vscode "docker.docker"
vscode "formulahendry.docker-explorer"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "kevinrose.vsc-python-indent"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.remote-repositories"
vscode "sdras.night-owl"
vscode "sissel.shopify-liquid"
